{
  "format": "graph-model",
  "generatedBy": "1.15.0",
  "convertedBy": "TensorFlow.js Converter v1.7.4",
  "userDefinedMetadata": {
    "signature": {
      "inputs": {
        "key:0": {
          "name": "key:0",
          "dtype": "DT_STRING",
          "tensorShape": {
            "dim": [{
              "size": "-1"
            }]
          }
        },
        "encoded_image_string_tensor:0": {
          "name": "encoded_image_string_tensor:0",
          "dtype": "DT_STRING",
          "tensorShape": {
            "dim": [{
              "size": "-1"
            }]
          }
        }
      },
      "outputs": {
        "detection_boxes:0": {
          "name": "detection_boxes:0",
          "dtype": "DT_FLOAT",
          "tensorShape": {
            "dim": [{
              "size": "-1"
            }, {
              "size": "40"
            }, {
              "size": "4"
            }]
          }
        },
        "detection_scores:0": {
          "name": "detection_scores:0",
          "dtype": "DT_FLOAT",
          "tensorShape": {
            "dim": [{
              "size": "-1"
            }, {
              "size": "40"
            }]
          }
        },
        "detection_classes_as_text:0": {
          "name": "detection_classes_as_text:0",
          "dtype": "DT_STRING",
          "tensorShape": {
            "dim": [{
              "size": "-1"
            }, {
              "size": "40"
            }]
          }
        },
        "detection_classes:0": {
          "name": "detection_classes:0",
          "dtype": "DT_FLOAT",
          "tensorShape": {
            "dim": [{
              "size": "-1"
            }, {
              "size": "40"
            }]
          }
        },
        "detection_multiclass_scores:0": {
          "name": "detection_multiclass_scores:0",
          "dtype": "DT_FLOAT",
          "tensorShape": {
            "dim": [{
              "size": "-1"
            }, {
              "size": "40"
            }, {
              "size": "2"
            }]
          }
        },
        "Identity:0": {
          "name": "Identity:0",
          "dtype": "DT_STRING",
          "tensorShape": {
            "dim": [{
              "size": "-1"
            }]
          }
        },
        "Tile_1:0": {
          "name": "Tile_1:0",
          "dtype": "DT_INT32",
          "tensorShape": {
            "dim": [{
              "size": "-1"
            }, {
              "size": "6"
            }]
          }
        },
        "num_detections:0": {
          "name": "num_detections:0",
          "dtype": "DT_FLOAT",
          "tensorShape": {
            "dim": [{
              "size": "-1"
            }]
          }
        }
      }
    }
  },
  "modelTopology": {
    "node": [{
      "name": "encoded_image_string_tensor/input",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_STRING",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_STRING"
        }
      }
    }, {
      "name": "map/strided_slice/stack",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "map/strided_slice/stack_1",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "map/TensorArrayUnstack/range/start",
      "op": "Const",
      "attr": {
        "dtype": {
          "type": "DT_INT32"
        },
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {}
          }
        }
      }
    }, {
      "name": "map/TensorArrayUnstack/range/delta",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {}
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "Preprocessor/mul/x",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {}
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "Preprocessor/sub/y",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {}
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "key",
      "op": "Placeholder",
      "attr": {
        "shape": {
          "shape": {
            "dim": [{
              "size": "-1"
            }]
          }
        },
        "dtype": {
          "type": "DT_STRING"
        }
      }
    }, {
      "name": "Postprocessor/Reshape/shape",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {
              "dim": [{
                "size": "2"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "Postprocessor/Decode/get_center_coordinates_and_sizes/transpose/perm",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {
              "dim": [{
                "size": "2"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "Postprocessor/stack/2",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {}
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "FeatureExtractor/detection_mnasfpn_v1_a_320_1/mnasnet-a1/mnas_net_model/mnas_blocks_3/se/Mean/reduction_indices",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {
              "dim": [{
                "size": "2"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_3/se/conv2d/kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "72"
              }, {
                "size": "6"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "Postprocessor/ExpandDims_1/dim",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {}
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_3/se/conv2d/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "6"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_3/se/conv2d_1/kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "6"
              }, {
                "size": "72"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_3/se/conv2d_1/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "72"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "index_to_string/Const",
      "op": "Const",
      "attr": {
        "dtype": {
          "type": "DT_STRING"
        },
        "value": {
          "tensor": {
            "dtype": "DT_STRING",
            "tensorShape": {}
          }
        }
      }
    }, {
      "name": "Postprocessor/Slice/begin",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {
              "dim": [{
                "size": "3"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "Postprocessor/Slice/size",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {
              "dim": [{
                "size": "3"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_4/se/conv2d/kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "120"
              }, {
                "size": "10"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_4/se/conv2d/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "10"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_4/se/conv2d_1/kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "10"
              }, {
                "size": "120"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_4/se/conv2d_1/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "120"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "Postprocessor/BatchMultiClassNonMaxSuppression/strided_slice_1/stack_1",
      "op": "Const",
      "attr": {
        "dtype": {
          "type": "DT_INT32"
        },
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }]
            }
          }
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_5/se/conv2d/kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "120"
              }, {
                "size": "10"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_5/se/conv2d/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "10"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_5/se/conv2d_1/kernel",
      "op": "Const",
      "attr": {
        "dtype": {
          "type": "DT_FLOAT"
        },
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "10"
              }, {
                "size": "120"
              }]
            }
          }
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_5/se/conv2d_1/bias",
      "op": "Const",
      "attr": {
        "dtype": {
          "type": "DT_FLOAT"
        },
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "120"
              }]
            }
          }
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_10/se/conv2d/kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "480"
              }, {
                "size": "20"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_10/se/conv2d/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "20"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_10/se/conv2d_1/kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "20"
              }, {
                "size": "480"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_10/se/conv2d_1/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "480"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_11/se/conv2d/kernel",
      "op": "Const",
      "attr": {
        "dtype": {
          "type": "DT_FLOAT"
        },
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "672"
              }, {
                "size": "28"
              }]
            }
          }
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_11/se/conv2d/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "28"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_11/se/conv2d_1/kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "28"
              }, {
                "size": "672"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_11/se/conv2d_1/bias",
      "op": "Const",
      "attr": {
        "dtype": {
          "type": "DT_FLOAT"
        },
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "672"
              }]
            }
          }
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_12/se/conv2d/kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "672"
              }, {
                "size": "28"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_12/se/conv2d/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "28"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_12/se/conv2d_1/kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "28"
              }, {
                "size": "672"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_12/se/conv2d_1/bias",
      "op": "Const",
      "attr": {
        "dtype": {
          "type": "DT_FLOAT"
        },
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "672"
              }]
            }
          }
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_13/se/conv2d/kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "960"
              }, {
                "size": "40"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "index_to_string/hash_table",
      "op": "HashTableV2",
      "attr": {
        "use_node_name_sharing": {
          "b": false
        },
        "key_dtype": {
          "type": "DT_INT64"
        },
        "value_dtype": {
          "type": "DT_STRING"
        },
        "container": {
          "s": ""
        },
        "shared_name": {
          "s": "aGFzaF90YWJsZV80NmEzNzM1MC05OTUzLTQwMWQtOWZjNC0zMzg2ZTc3YTg2Yzg="
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_13/se/conv2d/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "40"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_13/se/conv2d_1/kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "40"
              }, {
                "size": "960"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_13/se/conv2d_1/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "960"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "detection_classes_as_text/shape",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {
              "dim": [{
                "size": "2"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_14/se/conv2d/kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "960"
              }, {
                "size": "40"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_14/se/conv2d/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "40"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_14/se/conv2d_1/kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "40"
              }, {
                "size": "960"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/mnasnet-a1/mnas_blocks_14/se/conv2d_1/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "960"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/resample_p6/conv2d/kernel",
      "op": "Const",
      "attr": {
        "dtype": {
          "type": "DT_FLOAT"
        },
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "320"
              }, {
                "size": "64"
              }]
            }
          }
        }
      }
    }, {
      "name": "FeatureExtractor/resample_p6/conv2d/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "64"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy0/resample_0_2_4/conv2d/kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "320"
              }, {
                "size": "64"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy0/resample_0_2_4/conv2d/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "64"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/detection_mnasfpn_v1_a_320_1/feature_network/fpn_cells/cell_0/sub_policy0/resample_0_2_4/nearest_upsampling/Reshape/shape",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {
              "dim": [{
                "size": "6"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "FeatureExtractor/detection_mnasfpn_v1_a_320_1/feature_network/fpn_cells/cell_0/sub_policy0/resample_0_2_4/nearest_upsampling/ones",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "2"
              }, {
                "size": "1"
              }, {
                "size": "2"
              }, {
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/detection_mnasfpn_v1_a_320_1/feature_network/fpn_cells/cell_0/sub_policy0/resample_0_2_4/nearest_upsampling/Reshape_1/shape",
      "op": "Const",
      "attr": {
        "dtype": {
          "type": "DT_INT32"
        },
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {
              "dim": [{
                "size": "4"
              }]
            }
          }
        }
      }
    }, {
      "name": "FeatureExtractor/detection_mnasfpn_v1_a_320_1/feature_network/fpn_cells/cell_0/sub_policy0/resample_1_3_4/nearest_upsampling/Reshape/shape",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {
              "dim": [{
                "size": "6"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "FeatureExtractor/detection_mnasfpn_v1_a_320_1/feature_network/fpn_cells/cell_0/sub_policy0/resample_1_3_4/nearest_upsampling/ones",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "4"
              }, {
                "size": "1"
              }, {
                "size": "4"
              }, {
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy0/op_after_combine4/conv/depthwise_kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "3"
              }, {
                "size": "3"
              }, {
                "size": "64"
              }, {
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy1/resample_0_1_5/conv2d/kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "112"
              }, {
                "size": "64"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy1/resample_0_1_5/conv2d/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "64"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy1/resample_1_2_5/conv2d/kernel",
      "op": "Const",
      "attr": {
        "dtype": {
          "type": "DT_FLOAT"
        },
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "320"
              }, {
                "size": "64"
              }]
            }
          }
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy1/resample_1_2_5/conv2d/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "64"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy1/op_after_combine5/conv/depthwise_kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "3"
              }, {
                "size": "3"
              }, {
                "size": "64"
              }, {
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy2/resample_0_2_6/conv2d/kernel",
      "op": "Const",
      "attr": {
        "dtype": {
          "type": "DT_FLOAT"
        },
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "320"
              }, {
                "size": "64"
              }]
            }
          }
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy2/resample_0_2_6/conv2d/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "64"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy2/op_after_combine6/conv/depthwise_kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "3"
              }, {
                "size": "3"
              }, {
                "size": "64"
              }, {
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy3/resample_0_0_7/conv2d/kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "40"
              }, {
                "size": "64"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy3/resample_0_0_7/conv2d/bias",
      "op": "Const",
      "attr": {
        "dtype": {
          "type": "DT_FLOAT"
        },
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "64"
              }]
            }
          }
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy3/resample_1_1_7/conv2d/kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "112"
              }, {
                "size": "64"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy3/resample_1_1_7/conv2d/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "64"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy3/op_after_combine7/conv/depthwise_kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "3"
              }, {
                "size": "3"
              }, {
                "size": "64"
              }, {
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy4/op_after_combine8/conv/depthwise_kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "3"
              }, {
                "size": "3"
              }, {
                "size": "64"
              }, {
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy5/resample_0_1_9/conv2d/kernel",
      "op": "Const",
      "attr": {
        "dtype": {
          "type": "DT_FLOAT"
        },
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "112"
              }, {
                "size": "64"
              }]
            }
          }
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy5/resample_0_1_9/conv2d/bias",
      "op": "Const",
      "attr": {
        "dtype": {
          "type": "DT_FLOAT"
        },
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "64"
              }]
            }
          }
        }
      }
    }, {
      "name": "FeatureExtractor/detection_mnasfpn_v1_a_320_1/feature_network/fpn_cells/cell_0/sub_policy5/resample_1_8_9/nearest_upsampling/Reshape_1/shape",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {
              "dim": [{
                "size": "4"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy5/op_after_combine9/conv/depthwise_kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "3"
              }, {
                "size": "3"
              }, {
                "size": "64"
              }, {
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy6/resample_0_0_10/conv2d/kernel",
      "op": "Const",
      "attr": {
        "dtype": {
          "type": "DT_FLOAT"
        },
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "40"
              }, {
                "size": "64"
              }]
            }
          }
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy6/resample_0_0_10/conv2d/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "64"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy6/resample_1_1_10/conv2d/kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "112"
              }, {
                "size": "64"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy6/resample_1_1_10/conv2d/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "64"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/detection_mnasfpn_v1_a_320_1/feature_network/fpn_cells/cell_0/sub_policy6/resample_1_1_10/nearest_upsampling/Reshape/shape",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {
              "dim": [{
                "size": "6"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "FeatureExtractor/detection_mnasfpn_v1_a_320_1/feature_network/fpn_cells/cell_0/sub_policy6/resample_1_1_10/nearest_upsampling/Reshape_1/shape",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_INT32",
            "tensorShape": {
              "dim": [{
                "size": "4"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_INT32"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy6/op_after_combine10/conv/depthwise_kernel",
      "op": "Const",
      "attr": {
        "dtype": {
          "type": "DT_FLOAT"
        },
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "3"
              }, {
                "size": "3"
              }, {
                "size": "64"
              }, {
                "size": "1"
              }]
            }
          }
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy7/resample_0_1_11/conv2d/kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "112"
              }, {
                "size": "64"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy7/resample_0_1_11/conv2d/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "64"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy7/op_after_combine11/conv/depthwise_kernel",
      "op": "Const",
      "attr": {
        "dtype": {
          "type": "DT_FLOAT"
        },
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "3"
              }, {
                "size": "3"
              }, {
                "size": "64"
              }, {
                "size": "1"
              }]
            }
          }
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy8/resample_0_1_12/conv2d/kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "1"
              }, {
                "size": "1"
              }, {
                "size": "112"
              }, {
                "size": "64"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy8/resample_0_1_12/conv2d/bias",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "64"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_0/sub_policy8/op_after_combine12/conv/depthwise_kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "3"
              }, {
                "size": "3"
              }, {
                "size": "64"
              }, {
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_1/sub_policy0/op_after_combine4/conv/depthwise_kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "3"
              }, {
                "size": "3"
              }, {
                "size": "64"
              }, {
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_1/sub_policy1/op_after_combine5/conv/depthwise_kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "3"
              }, {
                "size": "3"
              }, {
                "size": "64"
              }, {
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_1/sub_policy2/op_after_combine6/conv/depthwise_kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "3"
              }, {
                "size": "3"
              }, {
                "size": "64"
              }, {
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_1/sub_policy3/op_after_combine7/conv/depthwise_kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "3"
              }, {
                "size": "3"
              }, {
                "size": "64"
              }, {
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_1/sub_policy4/op_after_combine8/conv/depthwise_kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "3"
              }, {
                "size": "3"
              }, {
                "size": "64"
              }, {
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_1/sub_policy5/op_after_combine9/conv/depthwise_kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "3"
              }, {
                "size": "3"
              }, {
                "size": "64"
              }, {
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_1/sub_policy6/op_after_combine10/conv/depthwise_kernel",
      "op": "Const",
      "attr": {
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "3"
              }, {
                "size": "3"
              }, {
                "size": "64"
              }, {
                "size": "1"
              }]
            }
          }
        },
        "dtype": {
          "type": "DT_FLOAT"
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_1/sub_policy7/op_after_combine11/conv/depthwise_kernel",
      "op": "Const",
      "attr": {
        "dtype": {
          "type": "DT_FLOAT"
        },
        "value": {
          "tensor": {
            "dtype": "DT_FLOAT",
            "tensorShape": {
              "dim": [{
                "size": "3"
              }, {
                "size": "3"
              }, {
                "size": "64"
              }, {
                "size": "1"
              }]
            }
          }
        }
      }
    }, {
      "name": "FeatureExtractor/fpn_cells/cell_1/sub_policy8/op_after_combine12/conv/depthwise_kernel",
      "op": "Const",
      "attr": {
        "dtype": {
